[
  {
    "dog_name": "Affenpinscher",
    "description": "The Affen’s apish look has been described many ways. They’ve been called “monkey dogs” and “ape terriers.” The French say diablotin moustachu (“mustached little devil”), and Star Wars fans argue whether they look more like Wookies or Ewoks.Standing less than a foot tall, these sturdy terrier-like dogs approach life with great confidence. “This isn’t a breed you train,” a professional dog handler tells us, “He’s like a human. You befriend him.” The dense, harsh coat is described as “neat but shaggy” and comes in several colors; the gait is light and confident. They can be willful and domineering, but mostly Affens are loyal, affectionate, and always entertaining. Affen people say they love being owned by their little monkey dogs. The Affenpinscher: loyal, curious, and famously amusing; this almost-human toy dog is fearless out of all proportion to his size. As with all great comedians, it’s the Affenpinscher’s apparent seriousness of purpose that makes his antics all the more amusing.",
    "temperament": "Confident, Famously Funny, Fearless",
    "popularity": 148,
    "min_height": 22.86,
    "max_height": 29.21,
    "min_weight": 3.17514659,
    "max_weight": 4.535923700000001,
    "min_expectancy": 12,
    "max_expectancy": 15,
    "group": "Toy Group",
    "grooming_frequency_value": 0.6,
    "grooming_frequency_category": "2-3 Times a Week Brushing",
    "shedding_value": 0.6,
    "shedding_category": "Seasonal",
    "energy_level_value": 0.6,
    "energy_level_category": "Regular Exercise",
    "trainability_value": 0.8,
    "trainability_category": "Easy Training",
    "demeanor_value": 1,
    "demeanor_category": "Outgoing"
  },
  {
    "dog_name": "Afghan Hound",
    "description": "The Afghan Hound is an ancient breed, his whole appearance one of dignity and aloofness – his eyes gazing into the distance as if in memory of ages past. An intelligent and independent mind, his whole appearance one of dignity and style. To his own he is devoted and loyal with a charming and lively personality. The Afghan Hound is an athlete capable of immense speed and requires a large fenced in yard and exercise daily.Since ancient times, Afghan Hounds have been famous for their elegant beauty. But the thick, silky, flowing coat that is the breed’s crowning glory isn’t just for show — it served as protection from the harsh climate in mountainous regions where Afghans originally earned their keep. Beneath the Afghan’s glamorous exterior is a powerful, agile hound — standing as high as 27 inches at the shoulder — built for a long day’s hunt. Their huge paw-pads acted as shock absorbers on their homeland’s punishing terrain.The Afghan Hound is a special breed for special people. A breed expert writes, “It’s not the breed for all would-be dog owners, but where the dog and owner combination is right, no animal can equal the Afghan Hound as a pet.” The Afghan Hound is an aloof and dignified aristocrat of sublime beauty. Despite his regal appearance, he is known for his profound loyalty, sensitive nature, and absolute love for those he calls his own.",
    "temperament": "Dignified, Profoundly Loyal, Aristocratic",
    "popularity": 113,
    "min_height": 63.5,
    "max_height": 68.58,
    "min_weight": 22.6796185,
    "max_weight": 27.2155422,
    "min_expectancy": 12,
    "max_expectancy": 15,
    "group": "Hound Group",
    "grooming_frequency_value": 0.8,
    "grooming_frequency_category": "Daily Brushing",
    "shedding_value": 0.2,
    "shedding_category": "Infrequent",
    "energy_level_value": 0.8,
    "energy_level_category": "Energetic",
    "trainability_value": 0.2,
    "trainability_category": "May be Stubborn",
    "demeanor_value": 0.2,
    "demeanor_category": "Aloof/Wary"
  },
  {
    "dog_name": "Airedale Terrier",
    "description": "The Airedale Terrier is the largest of all terrier breeds. Males stand about 23 inches at the shoulder, females a little less. The dense, wiry coat is tan with black markings. Long, muscular legs give Airedales a regal lift in their bearing, and the long head—with its sporty beard and mustache, dark eyes, and neatly folded ears—conveys a keen intelligence. Airedales are the very picture of an alert and willing terrier—only bigger. And, like his smaller cousins in the terrier family, he can be bold, determined, and stubborn. Airedales are docile and patient with kids but won’t back down when protecting hearth and home. Thanks to their famous do-it-all attitude, Airedales excel in all kinds of sports and family activities. His size, strength, and unflagging spirit have earned the Airedale Terrier the nickname “The King of Terriers.” The Airedale stands among the world’s most versatile dog breeds and has distinguished himself as hunter, athlete, and companion.",
    "temperament": "Friendly, Clever, Courageous",
    "popularity": 60,
    "min_height": 58.42,
    "max_height": 58.42,
    "min_weight": 22.6796185,
    "max_weight": 31.751465900000003,
    "min_expectancy": 11,
    "max_expectancy": 14,
    "group": "Terrier Group",
    "grooming_frequency_value": 0.6,
    "grooming_frequency_category": "2-3 Times a Week Brushing",
    "shedding_value": 0.4,
    "shedding_category": "Occasional",
    "energy_level_value": 0.6,
    "energy_level_category": "Regular Exercise",
    "trainability_value": 1,
    "trainability_category": "Eager to Please",
    "demeanor_value": 0.8,
    "demeanor_category": "Friendly"
  },
  {
    "dog_name": "Akita",
    "description": "Akitas are burly, heavy-boned spitz-type dogs of imposing stature. Standing 24 to 28 inches at the shoulder, Akitas have a dense coat that comes in several colors, including white. The head is broad and massive, and is balanced in the rear by a full, curled-over tail. The erect ears and dark, shining eyes contribute to an expression of alertness, a hallmark of the breed.Akitas are quiet, fastidious dogs. Wary of strangers and often intolerant of other animals, Akitas will gladly share their silly, affectionate side with family and friends. They thrive on human companionship. The large, independent-thinking Akita is hardwired for protecting those they love. They must be well socialized from birth with people and other dogs. Akitas are muscular, double-coated dogs of ancient Japanese lineage famous for their dignity, courage, and loyalty. In their native land, they are venerated as family protectors and symbols of good health, happiness, and long life.",
    "temperament": "Courageous, Dignified, Profoundly Loyal",
    "popularity": 47,
    "min_height": 60.96,
    "max_height": 71.12,
    "min_weight": 31.751465900000003,
    "max_weight": 58.9670081,
    "min_expectancy": 10,
    "max_expectancy": 13,
    "group": "Working Group",
    "grooming_frequency_value": 0.8,
    "grooming_frequency_category": "Daily Brushing",
    "shedding_value": 0.6,
    "shedding_category": "Seasonal",
    "energy_level_value": 0.8,
    "energy_level_category": "Energetic",
    "trainability_value": 1,
    "trainability_category": "Eager to Please",
    "demeanor_value": 0.6,
    "demeanor_category": "Alert/Responsive"
  },
  {
    "dog_name": "Alaskan Malamute",
    "description": "The Alaskan Malamute stands 23 to 25 inches at the shoulder and weighs 75 to 85 pounds. Everything about Mals suggests their origin as an arctic sled dog: The heavy bone, deep chest, powerful shoulders, and dense, weatherproof coat all scream, “I work hard for a living!” But their almond-shaped brown eyes have an affectionate sparkle, suggesting Mals enjoy snuggling with their humans when the workday is done. Mals are pack animals. And in your family “pack,” the leader must be you. If a Mal doesn’t respect you, he will wind up owning you instead of the other way around. Firm but loving training should begin in early puppyhood. That said, a well-behaved Mal is a joy to be with—playful, gentle, friendly, and great with kids. An immensely strong, heavy-duty worker of spitz type, the Alaskan Malamute is an affectionate, loyal, and playful but dignified dog recognizable by his well-furred plumed tail carried over the back, erect ears, and substantial bone.",
    "temperament": "Affectionate, Loyal, Playful",
    "popularity": 58,
    "min_height": 58.42,
    "max_height": 63.5,
    "min_weight": 34.01942775,
    "max_weight": 38.55535145,
    "min_expectancy": 10,
    "max_expectancy": 14,
    "group": "Working Group",
    "grooming_frequency_value": 0.6,
    "grooming_frequency_category": "2-3 Times a Week Brushing",
    "shedding_value": 0.6,
    "shedding_category": "Seasonal",
    "energy_level_value": 0.8,
    "energy_level_category": "Energetic",
    "trainability_value": 0.4,
    "trainability_category": "Independent",
    "demeanor_value": 0.8,
    "demeanor_category": "Friendly"
  },
  {
    "dog_name": "American Bulldog",
    "description": "The American Bulldog is a descendant of the English Bulldog. It is believed that the bulldog was in America as early as the 17th century. They came to the United States in the 1800s, with immigrants who brought their working bulldogs with them. Small farmers and ranchers used this all-around working dog for many tasks including farm guardians, stock dogs, and catch dogs. The breed largely survived, particularly in the southern states, due to its ability to bring down and catch feral pigs.The breed we know as the American Bulldog was originally known by many different names before the name American Bulldog became the standard. In different parts of the South he was known as the White English Southern Bulldog, but most commonly just “bulldog.” The breed was not called a bulldog because of a certain look, but because they did real bulldog work. Breed Contact InformationKatrina HuffmasterPhone:  850-519-3089 American Bulldogs are a well-balanced athletic dog that demonstrate great strength, endurance, agility, and a friendly attitude. Historically, they were bred to be a utility dog used for working the farm.",
    "temperament": "Loyal, Self-Confident",
    "popularity": "",
    "min_height": 50.8,
    "max_height": 63.5,
    "min_weight": 27.2155422,
    "max_weight": 45.359237,
    "min_expectancy": 10,
    "max_expectancy": 12,
    "group": "Foundation Stock Service",
    "grooming_frequency_value": 0.2,
    "grooming_frequency_category": "Occasional Bath/Brush",
    "shedding_value": 0.6,
    "shedding_category": "Seasonal",
    "energy_level_value": 0.8,
    "energy_level_category": "Energetic",
    "trainability_value": 0.6,
    "trainability_category": "Agreeable",
    "demeanor_value": 0.6,
    "demeanor_category": "Alert/Responsive"
  },
  {
    "dog_name": "American English Coonhound",
    "description": "Standing as high as 26 inches at the shoulder, American English Coonhounds are deep-chested, sweet-faced athletes beloved by sportsmen for their speed and endurance. Stretched tightly across the athletic frame is a medium-length coat of various patterns, some with ticking. The head is broad with a domed skull, with soft, low-hung ears and dark-brown eyes that glow with warmth and kindness.American English Coonhounds are mellow when off duty but tenacious and stubborn in pursuit of their ring-tailed prey. Their work drive and energy, the patience it takes to train them for things other than coon hunting, and their loud, ringing bark can make the breed a bad fit as house pets for novice owners. Some passionate fans of American English Coonhounds feel that without a sporting outlet for this breed’s houndy virtues, you’re simply wasting a good dog. These sleek and racy, lean but muscular hounds work dusk to dawn in pursuit of the wily raccoon. The sight of the American English Coonhound tearing through the moonlit woods, all sinew and determination, bawling their lusty night music, is coon-hunter heaven.",
    "temperament": "Sweet, Mellow, Sociable",
    "popularity": 175,
    "min_height": 58.42,
    "max_height": 66.04,
    "min_weight": 20.41165665,
    "max_weight": 29.48350405,
    "min_expectancy": 11,
    "max_expectancy": 12,
    "group": "Hound Group",
    "grooming_frequency_value": 0.2,
    "grooming_frequency_category": "Occasional Bath/Brush",
    "shedding_value": 0.4,
    "shedding_category": "Occasional",
    "energy_level_value": 0.8,
    "energy_level_category": "Energetic",
    "trainability_value": 0.6,
    "trainability_category": "Agreeable",
    "demeanor_value": 0.6,
    "demeanor_category": "Alert/Responsive"
  },
  {
    "dog_name": "American Eskimo Dog",
    "description": "The American Eskimo Dog comes in three sizes—standard, miniature, and toy—standing as tall as 19 inches at the shoulder or as short as 9 inches. Distinctive traits include a dense, sparkling white coat with a lion-like ruff around the chest and shoulders; a smiling face, with black nose, lips, and eye-rims that convey a keen, intelligent expression; and a plumed tail carried over the back. Some Eskies have markings with the delicious color name “biscuit cream.” They move with a bold and agile gait.Eskies are social animals and can develop problem behaviors when neglected or undertrained—they insist on being part of family life. Among the most trainable of breeds, the clever, kid-friendly Eskie practically invented the phrase “eager to please.” The American Eskimo Dog combines striking good looks with a quick and clever mind in a total brains-and-beauty package. Neither shy nor aggressive, Eskies are always alert and friendly, though a bit conservative when making new friends.",
    "temperament": "Playful, Perky, Smart",
    "popularity": 122,
    "min_height": 22.86,
    "max_height": 48.26,
    "min_weight": 2.7215542200000002,
    "max_weight": 15.875732950000002,
    "min_expectancy": 13,
    "max_expectancy": 15,
    "group": "Non-Sporting Group",
    "grooming_frequency_value": 0.4,
    "grooming_frequency_category": "Weekly Brushing",
    "shedding_value": 0.6,
    "shedding_category": "Seasonal",
    "energy_level_value": 0.8,
    "energy_level_category": "Energetic",
    "trainability_value": 1,
    "trainability_category": "Eager to Please",
    "demeanor_value": 1,
    "demeanor_category": "Outgoing"
  },
  {
    "dog_name": "American Foxhound",
    "description": "American Foxhounds are sleek, rangy hunters known for their speed, endurance, and work ethic. You can tell the American Foxhound apart from their British cousin the English Foxhound by length of leg—the American’s legs are longer and more finely boned—and by the American’s slightly arched loin (back end). American Foxhounds have large, soft eyes with an expression described as gentle and pleading.So far, so good. But Foxhounds come with special considerations. They need lots of exercise or they can get depressed and destructive. A Foxhound’s single-minded prey drive must be managed. Their loud bawling is melodious to hound lovers but can be a nuisance to neighbors, and training and housebreaking these independent souls can be a steep challenge for novice owners. American Foxhounds are good-natured, low-maintenance hounds who get on well with kids, dogs, even cats, but come with special considerations for prospective owners. They are closely associated with Revolutionary heroes and the rolling estates of old Virginia.",
    "temperament": "Independent, Easy-Going, Sweet-Tempered",
    "popularity": 186,
    "min_height": 53.34,
    "max_height": 63.5,
    "min_weight": 27.2155422,
    "max_weight": 31.751465900000003,
    "min_expectancy": 11,
    "max_expectancy": 13,
    "group": "Hound Group",
    "grooming_frequency_value": 0.2,
    "grooming_frequency_category": "Occasional Bath/Brush",
    "shedding_value": 0.6,
    "shedding_category": "Seasonal",
    "energy_level_value": 0.8,
    "energy_level_category": "Energetic",
    "trainability_value": 0.4,
    "trainability_category": "Independent",
    "demeanor_value": 0.8,
    "demeanor_category": "Friendly"
  },
  {
    "dog_name": "American Hairless Terrier",
    "description": "The American Hairless Terrier stands between 12 to 16 inches at the shoulder, and comes in both coated and hairless varieties. The hairless variety might have eyebrows and whiskers, while the coated has a short, shiny coat. The skin of the hairless is smooth and warm to the touch. The broad, wedge-shaped head is a hallmark of both varieties. Erect, V-shaped ears frame the round, expressive eyes that gleam with curiosity.The American Hairless moves with jaunty pep in his step that announces real terrier attitude. The hairless variety is as hypoallergenic as a dog can get. Hairlessness, though, presents its own challenges. Sunburn is a concern, and cold weather requires special precautions. This breed is protective of their humans and make alert watchdogs. The American Hairless Terrier, a Louisiana native, is a smart, inquisitive, and playful dog that comes in hairless and coated varieties. He is a fine choice for allergy sufferers who want a dog with true terrier grit and courage.",
    "temperament": "Energetic, Alert, Curious",
    "popularity": 136,
    "min_height": 30.48,
    "max_height": 40.64,
    "min_weight": 5.4431084400000005,
    "max_weight": 7.25747792,
    "min_expectancy": 14,
    "max_expectancy": 16,
    "group": "Terrier Group",
    "grooming_frequency_value": "",
    "grooming_frequency_category": "",
    "shedding_value": "",
    "shedding_category": "",
    "energy_level_value": "",
    "energy_level_category": "",
    "trainability_value": "",
    "trainability_category": "",
    "demeanor_value": "",
    "demeanor_category": ""
  },
  {
    "dog_name": "American Leopard Hound",
    "description": "The American Leopard Hound is a medium to large size dog and comes in three patterns: Solid, Leopard and Brindle; nine different official colors; and a variety of markings, however, sixty percent of all American Leopards are solid-colored dogs. The breed is very versatile in hunting a variety of game species including, but not limited to, raccoon, bear, bobcat, cougar, squirrel, and any other tree-minded game. As an especially tough breed, they also fare exceptionally well in extreme weather, both hot and cold. The American Leopard was officially organized and named the American Leopard Cur in 1960, but changed by the breed club members to the American Leopard Hound on May 1, 2008, years before coming to the American Kennel Club. Breed ContactName: Jackie CarpenterEmail: plott_dog@yahoo.com Intelligence is one of the American Leopard Hound's very best attributes. The breed is loving and affectionate toward their family and they are extremely protective of children. American Leopards are one of the oldest tree dog breeds in the U.S. and have extremely strong tracking abilities, often able to track prey for miles.",
    "temperament": "Sociable, Energetic, Intelligent",
    "popularity": "",
    "min_height": 53.34,
    "max_height": 68.58,
    "min_weight": 20.41165665,
    "max_weight": 31.751465900000003,
    "min_expectancy": 12,
    "max_expectancy": 15,
    "group": "Foundation Stock Service",
    "grooming_frequency_value": 0.4,
    "grooming_frequency_category": "Weekly Brushing",
    "shedding_value": 0.6,
    "shedding_category": "Seasonal",
    "energy_level_value": 0.8,
    "energy_level_category": "Energetic",
    "trainability_value": 1,
    "trainability_category": "Eager to Please",
    "demeanor_value": 0.6,
    "demeanor_category": "Alert/Responsive"
  },
  {
    "dog_name": "American Staffordshire Terrier",
    "description": "AmStaffs are stocky, muscular bull-type terriers standing 17 to 19 inches at the shoulder. The head is broad, the jaws well defined, the cheekbones pronounced, and the dark, round eyes are set wide apart. AmStaff movement is agile and graceful, with a springy gait that advertises the breed’s innate confidence. The stiff, glossy coat comes in many colors and patterns. AmStaffers describe their dogs as keenly aware of their surroundings, game for anything, and lovable “personality dogs” around the house. AmStaffs like mental and physical challenges. They are highly trainable, as their many forays into showbiz suggest. When acquiring an AmStaff, there’s only one way to go: Do your homework and find a responsible AKC breeder. The American Staffordshire Terrier, known to their fans as AmStaffs, are smart, confident, good-natured companions. Their courage is proverbial. A responsibly bred, well-socialized AmStaff is a loyal, trustworthy friend to the end.",
    "temperament": "Confident, Smart, Good-Natured",
    "popularity": 85,
    "min_height": 43.18,
    "max_height": 48.26,
    "min_weight": 18.143694800000002,
    "max_weight": 31.751465900000003,
    "min_expectancy": 12,
    "max_expectancy": 16,
    "group": "Terrier Group",
    "grooming_frequency_value": 0.2,
    "grooming_frequency_category": "Occasional Bath/Brush",
    "shedding_value": 0.4,
    "shedding_category": "Occasional",
    "energy_level_value": 0.6,
    "energy_level_category": "Regular Exercise",
    "trainability_value": 0.6,
    "trainability_category": "Agreeable",
    "demeanor_value": 0.6,
    "demeanor_category": "Alert/Responsive"
  },
  {
    "dog_name": "American Water Spaniel",
    "description": "American Water Spaniels are muscular midsize gundogs, not flashy in looks or performance, and recognizable by a luscious brown coat that is either tightly curled or wavy. Bred to work the icy waters and marshy banks of the Great Lakes region, these spaniels are ideally outfitted for the job: The coat is dense and waterproof, the feet are thickly padded, the toes are webbed, and the body is small enough for the dog to hop in and out of a skiff without rocking the boat. The breed’s admirers describe a merry, intelligent, and versatile spaniel suited to a variety of dog sports. As hunters, they combine the working traits of spaniels and retrievers. The key to the American Water Spaniel’s happiness is activity, especially alongside their adored human. An underemployed dog can be barky and destructive. The American Water Spaniel, native to the lake country of the upper Midwest, is an upbeat, outdoorsy athlete who loves to hunt and swim. They are known to be happy, eager, and charming, though aloof with strangers and a bit stubborn.",
    "temperament": "Eager, Happy, Charming",
    "popularity": 166,
    "min_height": 38.1,
    "max_height": 45.72,
    "min_weight": 11.33980925,
    "max_weight": 20.41165665,
    "min_expectancy": 10,
    "max_expectancy": 14,
    "group": "Sporting Group",
    "grooming_frequency_value": 0.6,
    "grooming_frequency_category": "2-3 Times a Week Brushing",
    "shedding_value": 0.2,
    "shedding_category": "Infrequent",
    "energy_level_value": 0.6,
    "energy_level_category": "Regular Exercise",
    "trainability_value": 1,
    "trainability_category": "Eager to Please",
    "demeanor_value": 0.8,
    "demeanor_category": "Friendly"
  },
  {
    "dog_name": "Anatolian Shepherd Dog",
    "description": "The Anatolian Shepherd Dog stands between 27 and 29 inches at the shoulder and can weigh as much as 150 pounds. Profusely muscled but nimble afoot, Anatolians are more than a match for the predators and harsh terrain of their homeland. Anatolians descend from some of the oldest known domestic-canine bloodlines. This lends the breed a sense of timelessness, a no-frills, untouched quality that takes us back 6,000 years to the Bronze Age.Anatolians are smart, devoted, responsive, and adaptable. They will protect their flock—livestock, children, smaller dogs, even the family cat—with intensity. Anatolian owners must be strong leaders, willing and able to handle a dog as dominating and demanding as he is calm and loving. An Anatolian Shepherd Dog is a rugged, imposing flock guardian of ancient lineage. Protective and territorial, but also intelligent, patient, and profoundly loyal, these muscular avengers are prized as working guard dogs without equal.",
    "temperament": "Loyal, Independent, Reserved",
    "popularity": 90,
    "min_height": 68.58,
    "max_height": 73.66,
    "min_weight": 36.287389600000004,
    "max_weight": 68.0388555,
    "min_expectancy": 11,
    "max_expectancy": 13,
    "group": "Working Group",
    "grooming_frequency_value": 0.4,
    "grooming_frequency_category": "Weekly Brushing",
    "shedding_value": 0.6,
    "shedding_category": "Seasonal",
    "energy_level_value": 0.6,
    "energy_level_category": "Regular Exercise",
    "trainability_value": 0.4,
    "trainability_category": "Independent",
    "demeanor_value": 0.4,
    "demeanor_category": "Reserved with Strangers"
  },
  {
    "dog_name": "Appenzeller Sennenhund",
    "description": "The Appenzeller Sennenhund is also known as the Appenzeller Mountain Dog or Appenzell Cattle Dog. He is lively, high-spirited, self-assured, reliable, and fearless. Slightly suspicious of strangers, he is a good watchdog who cannot be bribed. The breed’s intelligence make them highly capable learners. Due to his personality and exercise needs, he is ill-suited to apartment living. The Appenzeller Sennenhund is tri-color, medium-sized, and almost squarely built and balanced. He is muscular and agile and makes a good driving, watch, guard, house or farm dog. Due to their versatility and willingness, they excel in agility, obedience, herding and search and rescue.",
    "temperament": "Agile, Versatile, Lively",
    "popularity": "",
    "min_height": 48.26,
    "max_height": 55.88,
    "min_weight": 21.772433760000002,
    "max_weight": 31.751465900000003,
    "min_expectancy": 12,
    "max_expectancy": 15,
    "group": "Foundation Stock Service",
    "grooming_frequency_value": 0.4,
    "grooming_frequency_category": "Weekly Brushing",
    "shedding_value": 0.8,
    "shedding_category": "Regularly",
    "energy_level_value": 1,
    "energy_level_category": "Needs Lots of Activity",
    "trainability_value": 0.2,
    "trainability_category": "May be Stubborn",
    "demeanor_value": 0.4,
    "demeanor_category": "Reserved with Strangers"
  },
  {
    "dog_name": "Australian Cattle Dog",
    "description": "Standing between 17 to 20 inches at the shoulder, the Australian Cattle Dog is a sturdy, hard-muscled herder of strength and agility. The ACD is born with a white coat that turns blue-gray or red. Both coat varieties feature distinctive mottling or specking patterns. ACDs have immense work drive and excel at hunting, chasing, and, of course, moving livestock. Their boundless energy and supple gait make them excellent running partners.ACDs are true-blue loyal, famously smart, ever alert, and wary of strangers. If an ACD isn’t challenged, he easily becomes bored and gets into mischief. It is recommended that ACD owners participate with their dog in some work, sport, or regular exercise to keep him mentally and physically fit. The compact but muscular Australian Cattle Dog, also called Blue Heeler or Queensland Heeler, is related to Australia’s famous wild dog, the Dingo. These resilient herders are intelligent enough to routinely outsmart their owners.",
    "temperament": "Alert, Curious, Pleasant",
    "popularity": 55,
    "min_height": 43.18,
    "max_height": 50.8,
    "min_weight": 15.875732950000002,
    "max_weight": 22.6796185,
    "min_expectancy": 12,
    "max_expectancy": 16,
    "group": "Herding Group",
    "grooming_frequency_value": 0.2,
    "grooming_frequency_category": "Occasional Bath/Brush",
    "shedding_value": 0.8,
    "shedding_category": "Regularly",
    "energy_level_value": 1,
    "energy_level_category": "Needs Lots of Activity",
    "trainability_value": 0.2,
    "trainability_category": "May be Stubborn",
    "demeanor_value": 0.4,
    "demeanor_category": "Reserved with Strangers"
  },
  {
    "dog_name": "Australian Kelpie",
    "description": "As a herding dog, the Australian Kelpie is intensely loyal and devoted to duty. He has a natural instinct and aptitude for working in sheep, whether it be in open fields or enclosed yards. This breed originated from Collie type dogs imported from Scotland, but was developed to withstand the harsh heat and dry conditions of the vast open spaces of Australia. The Australian Kelpie is a lithe, active dog, capable of untiring work. He is extremely intelligent, alert, and eager with unlimited energy.",
    "temperament": "Loyal, Alert, Intelligent",
    "popularity": "",
    "min_height": 43.18,
    "max_height": 50.8,
    "min_weight": "",
    "max_weight": "",
    "min_expectancy": 10,
    "max_expectancy": 13,
    "group": "Foundation Stock Service",
    "grooming_frequency_value": 0.4,
    "grooming_frequency_category": "Weekly Brushing",
    "shedding_value": 0.8,
    "shedding_category": "Regularly",
    "energy_level_value": 0.8,
    "energy_level_category": "Energetic",
    "trainability_value": 1,
    "trainability_category": "Eager to Please",
    "demeanor_value": 0.6,
    "demeanor_category": "Alert/Responsive"
  },
  {
    "dog_name": "Australian Shepherd",
    "description": "The Australian Shepherd, the cowboy’s herding dog of choice, is a medium-sized worker with a keen, penetrating gaze in the eye. Aussie coats offer different looks, including merle (a mottled pattern with contrasting shades of blue or red). In all ways, they’re the picture of rugged and agile movers of stock. Aussies exhibit an irresistible impulse to herd, anything: birds, dogs, kids. This strong work drive can make Aussies too much dog for a sedentary pet owner. Aussies are remarkably intelligent, quite capable of hoodwinking an unsuspecting novice owner. In short, this isn’t the pet for everyone. But if you’re looking for a brainy, tireless, and trainable partner for work or sport, your search might end here. The Australian Shepherd, a lean, tough ranch dog, is one of those “only in America” stories: a European breed perfected in California by way of Australia. Fixtures on the rodeo circuit, they are closely associated with the cowboy life.",
    "temperament": "Smart, Work-Oriented, Exuberant",
    "popularity": 17,
    "min_height": 45.72,
    "max_height": 58.42,
    "min_weight": 18.143694800000002,
    "max_weight": 29.48350405,
    "min_expectancy": 12,
    "max_expectancy": 15,
    "group": "Herding Group",
    "grooming_frequency_value": 0.4,
    "grooming_frequency_category": "Weekly Brushing",
    "shedding_value": 0.6,
    "shedding_category": "Seasonal",
    "energy_level_value": 0.8,
    "energy_level_category": "Energetic",
    "trainability_value": 1,
    "trainability_category": "Eager to Please",
    "demeanor_value": 0.6,
    "demeanor_category": "Alert/Responsive"
  },
  {
    "dog_name": "Australian Stumpy Tail Cattle Dog",
    "description": "The Australian Stumpy Tail Cattle Dog is not an Australian Cattle Dog with a docked tail. There are major structural differences in breed type between the two breeds of cattle dogs. Stumpy Tail Cattle Dogs are a natural bob-tail breed. Some Stumpy Tail pups are born with long tails and should not be discarded from a breeding program if they are of structural quality, but rather bred back to quality natural bob tails. Australian Stumpy Tail Cattle Dog Society of the United StatesDenyse Adams: chredacds8@gmail.comLori Graham: lgraham1145@yahoo.comKim McDonald: breezyacresstumpies@gmail.comKevin Nicholson: nicholson.klnicholson@gmail.com The Australian Stumpy Tail Cattle Dog is not an Australian Cattle Dog with a docked tail. He is a naturally bob-tailed breed and stands square with plenty of leg length under the body.",
    "temperament": "Alert, Trainable, Comical",
    "popularity": "",
    "min_height": 43.18,
    "max_height": 50.8,
    "min_weight": 14.51495584,
    "max_weight": 20.41165665,
    "min_expectancy": 12,
    "max_expectancy": 15,
    "group": "Foundation Stock Service",
    "grooming_frequency_value": 0.4,
    "grooming_frequency_category": "Weekly Brushing",
    "shedding_value": 0.4,
    "shedding_category": "Occasional",
    "energy_level_value": 0.8,
    "energy_level_category": "Energetic",
    "trainability_value": 0.8,
    "trainability_category": "Easy Training",
    "demeanor_value": 0.6,
    "demeanor_category": "Alert/Responsive"
  },
  {
    "dog_name": "Australian Terrier",
    "description": "Australian Terriers are small but sturdy, self-confident terriers known for a longish torso, distinctive coat furnishings around the neck and forequarters, and a topknot of soft, silky hair that contrasts in texture with an otherwise harsh coat. A long neck lends a dash of elegance to this rough-and-ready terrier, and the dark eyes sparkle with a keen intelligence. Coat colors are blue-and-tan, or solid red or sandy. Aussies move with the free and easy gait of a working dog. They are alert watchdogs and said to be quick studies when training. True terriers, Aussies love digging, and the urge to chase small, furry critters has never left them. Not always a great fit in multi-dog households, Aussies want you all to themselves. The diminutive Australian Terrier is plucky, spirited, and smart—how did they fit so much dog into such a bitty package? Upbeat and lively, the self-assured Aussie approaches life with plenty of the old-time terrier curiosity and grit.",
    "temperament": "Affectionate, Courageous, Spirited",
    "popularity": 140,
    "min_height": 25.4,
    "max_height": 27.94,
    "min_weight": 6.80388555,
    "max_weight": 9.071847400000001,
    "min_expectancy": 11,
    "max_expectancy": 15,
    "group": "Terrier Group",
    "grooming_frequency_value": 0.4,
    "grooming_frequency_category": "Weekly Brushing",
    "shedding_value": 0.2,
    "shedding_category": "Infrequent",
    "energy_level_value": 0.8,
    "energy_level_category": "Energetic",
    "trainability_value": 0.6,
    "trainability_category": "Agreeable",
    "demeanor_value": 0.8,
    "demeanor_category": "Friendly"
  },
  {
    "dog_name": "Azawakh",
    "description": "This ancient hunting hound is so lean and rangy that his bone structure and musculature can plainly be seen beneath his skin. The smooth S-shaped contours, deep chest, and aerodynamic head mark the Azwakh as a member of the sighthound family, canine sprinters that rely on keen vision and blazing speed to fix and course their prey. The ultrafine coat comes in several colors and patterns. The overall look of this leggy hound is one of elegance and fineness, but don’t be fooled: This is a tough, durable hunter who’s been chasing gazelle across the scorching sands of the Sahara for more than a thousand years. Tall and elegant, the Azawakh is a West African sighthound who originates from the countries of Burkina Faso, Mali, and Niger. The Azawakh has a short, fine coat which may come in any color or color combinations: red, clear sand to fawn, brindled, parti-color (which may be predominantly white), blue, black and brown. The head may have a black mask and there may be white markings on the legs, bib and at the tip of tail. There are no color or marking disqualifications in the breed. Befitting its heritage, the Azawakh excels as a companion, guardian and a lure courser in the United States.",
    "temperament": "Loyal, Independent, Deeply Affectionate",
    "popularity": "of",
    "min_height": 59.69,
    "max_height": 73.66,
    "min_weight": 14.968548210000002,
    "max_weight": 24.947580350000003,
    "min_expectancy": 12,
    "max_expectancy": 15,
    "group": "Hound Group",
    "grooming_frequency_value": 0.4,
    "grooming_frequency_category": "Weekly Brushing",
    "shedding_value": 0.4,
    "shedding_category": "Occasional",
    "energy_level_value": 0.6,
    "energy_level_category": "Regular Exercise",
    "trainability_value": 0.4,
    "trainability_category": "Independent",
    "demeanor_value": 0.8,
    "demeanor_category": "Friendly"
  },
  {
    "dog_name": "Barbet",
    "description": "The defining characteristic of this rustic, medium-sized bird dog is the dense curly coat that covers him from the top of his large, broad head to the tip of his curving tail. The coat comes in shades of black, gray, brown, or fawn, sometimes with white markings. The breed’s delightfully shaggy coat and amiable nature creates the impression of a Muppet come to life, but the Barbet is a strong, solidly-built dog bred for centuries to be a keen hunter and tireless swimmer. Barbets are very intelligent and learn new things quickly. They have a calm nature and are easy to live with as long as their exercise needs are being met. An archetypic water dog of France, the Barbet is a rustic breed of medium size and balanced proportions who appears in artwork as early as the 16th century. In profile, the Barbet is slightly rectangular with a substantial head and long, sweeping tail. He has a long, dense covering of curly hair and a distinctive beard. An agile athlete, the Barbet has been used primarily to locate, flush, and retrieve birds. He has a cheerful disposition and is very social and loyal.",
    "temperament": "Friendly, Bright, Sweet-Natured",
    "popularity": "of",
    "min_height": 48.26,
    "max_height": 62.230000000000004,
    "min_weight": 15.875732950000002,
    "max_weight": 29.48350405,
    "min_expectancy": 12,
    "max_expectancy": 14,
    "group": "Sporting Group",
    "grooming_frequency_value": 0.4,
    "grooming_frequency_category": "Weekly Brushing",
    "shedding_value": 0.2,
    "shedding_category": "Infrequent",
    "energy_level_value": 0.6,
    "energy_level_category": "Regular Exercise",
    "trainability_value": 0.6,
    "trainability_category": "Agreeable",
    "demeanor_value": 0.8,
    "demeanor_category": "Friendly"
  },
  {
    "dog_name": "Basenji",
    "description": "Basenjis are small, graceful hounds standing 16 or 17 inches at the shoulder. They are recognizable by their glistening short coat, tightly curled tail, and wrinkled forehead and expressive almond-shaped eyes that convey a variety of subtle, humanlike emotions.Basenjis are a lovely sight at a standstill but more impressive yet at a fast trot, when they exhibit the long, smooth strides of a mini-racehorse. And yes, it’s true, they don’t bark, but they make their feelings known with an odd sound described as something between a chortle and a yodel. Basenjis are fastidious and will groom themselves like cats. This has been called a “cult breed”—small in numbers, but those lucky enough to own one do so with singular devotion. The Basenji, Africa’s “Barkless Dog,” is a compact, sweet-faced hunter of intelligence and poise. They are unique and beguiling pets, best for owners who can meet their exercise needs and the challenge of training this catlike canine.",
    "temperament": "Independent, Smart, Poised",
    "popularity": 87,
    "min_height": 40.64,
    "max_height": 43.18,
    "min_weight": 9.979032140000001,
    "max_weight": 10.886216880000001,
    "min_expectancy": 13,
    "max_expectancy": 14,
    "group": "Hound Group",
    "grooming_frequency_value": 0.2,
    "grooming_frequency_category": "Occasional Bath/Brush",
    "shedding_value": 0.4,
    "shedding_category": "Occasional",
    "energy_level_value": 0.8,
    "energy_level_category": "Energetic",
    "trainability_value": 0.4,
    "trainability_category": "Independent",
    "demeanor_value": 0.4,
    "demeanor_category": "Reserved with Strangers"
  },
  {
    "dog_name": "Basset Fauve de Bretagne",
    "description": "The Basset Fauve de Bretagne, also known as the Fawn Colored Brittany Basset, is a small, stocky, rough-coated hardy dog that is energetic and fast for its size. The Fauve gets along well with children and other pets. Training and socialization is a must or Fauves can get into mischief. Not nuisance barkers, you will, however, know if a rabbit runs through the yard, as they then give the hound “voice” and chase. This breed is as happy romping in the field as he is curled up next to the family on the sofa. Smart, courageous and determined, the Basset Fauve de Bretagne is a serious hunter, easily adaptable to different types of game and terrain. It is equally an excellent companion dog, being cheerful, intelligent and eager to please.",
    "temperament": "Smart, Cheerful, Determined",
    "popularity": "",
    "min_height": 31.75,
    "max_height": 39.37,
    "min_weight": 12.24699399,
    "max_weight": 15.875732950000002,
    "min_expectancy": 12,
    "max_expectancy": 12,
    "group": "Foundation Stock Service",
    "grooming_frequency_value": 0.4,
    "grooming_frequency_category": "Weekly Brushing",
    "shedding_value": 0.6,
    "shedding_category": "Seasonal",
    "energy_level_value": 0.6,
    "energy_level_category": "Regular Exercise",
    "trainability_value": 0.2,
    "trainability_category": "May be Stubborn",
    "demeanor_value": 1,
    "demeanor_category": "Outgoing"
  },
  {
    "dog_name": "Basset Hound",
    "description": "The Basset Hound stands no higher than 14 inches at the shoulder but, with his remarkably heavy bone, powerful little legs, and massive paws, he possesses big-dog strength and stamina. Bassets are famous for a large, domed head that features extremely long, velvety ears, mournful eyes, and a wrinkled brow, which give the breed the look of a sad clown. Built more for endurance than speed, the Basset moves in a deliberate but effortless manner. The breed’s scenting ability is uncanny; it’s said that among dogs only the Bloodhound’s nose is more accurate. Mild and agreeable at home, the Basset is stubborn on the trail and barks in a loud, ringing voice. Although they may not be wildly demonstrative in their affections, they are steadfastly loyal. Among the most appealing of the AKC breeds, the endearing and instantly recognizable Basset Hound is a perennial favorite of dog lovers all over the world. This low-slung and low-key hound can be sometimes stubborn, but is always charming.",
    "temperament": "Charming, Patient, Low-Key",
    "popularity": 39,
    "min_height": 38.1,
    "max_height": 38.1,
    "min_weight": 18.143694800000002,
    "max_weight": 29.48350405,
    "min_expectancy": 12,
    "max_expectancy": 13,
    "group": "Hound Group",
    "grooming_frequency_value": 0.6,
    "grooming_frequency_category": "2-3 Times a Week Brushing",
    "shedding_value": 0.4,
    "shedding_category": "Occasional",
    "energy_level_value": 0.2,
    "energy_level_category": "Couch Potato",
    "trainability_value": 0.4,
    "trainability_category": "Independent",
    "demeanor_value": 0.8,
    "demeanor_category": "Friendly"
  },
  {
    "dog_name": "Bavarian Mountain Scent Hound",
    "description": "Hailing from Germany, the Bavarian Mountain Scent Hound is the Bayerischer Gebirgsschweisshund in its native German. The breed’s most notable trait is its outstanding “cold nose” tracking ability. His nose is so acute, he can distinguish between the injured game he is hunting and other animals of the same species. This somewhat lightweight, active, medium-sized breed is devoted to his owner, but can be reserved with strangers. He is not a kennel dog and prefers to be around his human family. The Bavarian Mountain Scent Hound is calm and balanced, devoted to its owner, and reserved with strangers. He is a sound, self-assured, unafraid, biddable dog, neither shy nor aggressive.",
    "temperament": "Loyal, Versatile, Reserved with Strangers",
    "popularity": "",
    "min_height": 43.18,
    "max_height": 52.07,
    "min_weight": 16.78291769,
    "max_weight": 29.937096420000003,
    "min_expectancy": 12,
    "max_expectancy": 15,
    "group": "Foundation Stock Service",
    "grooming_frequency_value": 0.4,
    "grooming_frequency_category": "Weekly Brushing",
    "shedding_value": 0.8,
    "shedding_category": "Regularly",
    "energy_level_value": 0.6,
    "energy_level_category": "Regular Exercise",
    "trainability_value": 0.6,
    "trainability_category": "Agreeable",
    "demeanor_value": 0.4,
    "demeanor_category": "Reserved with Strangers"
  },
  {
    "dog_name": "Beagle",
    "description": "There are two Beagle varieties: those standing under 13 inches at the shoulder, and those between 13 and 15 inches. Both varieties are sturdy, solid, and “big for their inches,” as dog folks say. They come in such pleasing colors as lemon, red and white, and tricolor. The Beagle’s fortune is in his adorable face, with its big brown or hazel eyes set off by long, houndy ears set low on a broad head.A breed described as “merry” by its fanciers, Beagles are loving and lovable, happy, and companionable—all qualities that make them excellent family dogs. No wonder that for years the Beagle has been the most popular hound dog among American pet owners. These are curious, clever, and energetic hounds who require plenty of playtime. Not only is the Beagle an excellent hunting dog and loyal companion, it is also happy-go-lucky, funny, and—thanks to its pleading expression—cute. They were bred to hunt in packs, so they enjoy company and are generally easygoing.",
    "temperament": "Friendly, Curious, Merry",
    "popularity": 6,
    "min_height": 33.02,
    "max_height": 38.1,
    "min_weight": 5.8967008100000005,
    "max_weight": 13.6077711,
    "min_expectancy": 10,
    "max_expectancy": 15,
    "group": "Hound Group",
    "grooming_frequency_value": 0.6,
    "grooming_frequency_category": "2-3 Times a Week Brushing",
    "shedding_value": 0.6,
    "shedding_category": "Seasonal",
    "energy_level_value": 0.8,
    "energy_level_category": "Energetic",
    "trainability_value": 0.6,
    "trainability_category": "Agreeable",
    "demeanor_value": 0.8,
    "demeanor_category": "Friendly"
  },
  {
    "dog_name": "Bearded Collie",
    "description": "Standing 20 to 22 inches at the shoulder and covered head to tail in a shaggy double coat, Beardies bear a passing resemblance to another British favorite, the Old English Sheepdog. Beneath the coats, Beardies are the more lean and angular of the two. The lavish facial hair shouldn’t obscure the characteristic expression: a dreamy, faraway gaze.These rambunctious comics can be a handful—but mostly, Beardies are approximately 50 pounds of heart, energy, and laughter. Well-socialized Beardies will get on nicely with other animals and kids. They bore easily, and training must be kept interesting. Outdoorsy families looking for a sturdy dog to share an uptempo lifestyle will never find a more affectionate and amusing sidekick. A boisterous and charismatic droving dog from Scotland, the shaggy-coated Bearded Collie (“Beardie” to his friends) enjoys outdoor exercise in all weather. Bred to be independent decision-makers, they can be willful but are always friendly.",
    "temperament": "Smart, Bouncy, Charismatic",
    "popularity": 127,
    "min_height": 50.8,
    "max_height": 55.88,
    "min_weight": 20.41165665,
    "max_weight": 24.947580350000003,
    "min_expectancy": 12,
    "max_expectancy": 14,
    "group": "Herding Group",
    "grooming_frequency_value": 0.8,
    "grooming_frequency_category": "Daily Brushing",
    "shedding_value": 0.6,
    "shedding_category": "Seasonal",
    "energy_level_value": 0.6,
    "energy_level_category": "Regular Exercise",
    "trainability_value": 0.4,
    "trainability_category": "Independent",
    "demeanor_value": 1,
    "demeanor_category": "Outgoing"
  },
  {
    "dog_name": "Beauceron",
    "description": "Beaucerons are muscular, rugged, and large, standing as high as 27.5 inches at the shoulder, and yet graceful and in all ways balanced. Their dark black coats feature handsome squirrel-red accents, including the red feet that give the breed its French nickname Bas-Rouge (“red stockings”). They’re also seen in a black-gray-tan coat. The long head is well chiseled, and the dark brown eyes project an expression breed fanciers describe as frank and confident. They’re not for novice owners, who might end up being owned by their dominant dog instead of the other way around. That said, well-trained and socialized Beaucerons are levelheaded watchdogs and guardians, especially good with the young, the small, and the defenseless. The Beauceron is imposing and powerful, but also remarkably smart, spirited, and a versatile herder—imagine a Border Collie’s brain in a 100-pound body. They are especially beloved by women as a dashing but sensitive companion and protector.",
    "temperament": "Gentle, Faithful, Obedient",
    "popularity": 124,
    "min_height": 60.96,
    "max_height": 69.85,
    "min_weight": 31.751465900000003,
    "max_weight": 49.895160700000005,
    "min_expectancy": 10,
    "max_expectancy": 12,
    "group": "Herding Group",
    "grooming_frequency_value": 0.6,
    "grooming_frequency_category": "2-3 Times a Week Brushing",
    "shedding_value": 1,
    "shedding_category": "Frequent",
    "energy_level_value": 1,
    "energy_level_category": "Needs Lots of Activity",
    "trainability_value": 0.8,
    "trainability_category": "Easy Training",
    "demeanor_value": 0.4,
    "demeanor_category": "Reserved with Strangers"
  },
  {
    "dog_name": "Bedlington Terrier",
    "description": "Bedlingtons are lithe, energetic Englishmen. The crisp, curly coat; arched back; tasseled ears; scimitar-shaped tail; and fleecy, pear-shaped head are identifying features of this one-of-a-kind breed. As the curvy contours indicate, there’s sighthound—Whippet, most likely—in their family tree. Bedlingtons move with a light, springy step and when roused to pursuit can run like the wind.Rollicking, charming, and full of fun, Bedlingtons want most to be their family’s center of attention and are known to be protective of loved ones. For an active family looking for a no-shedding, lively, and loyal companion, the search might end here. Graceful terriers in sheep’s clothing, Bedlington Terriers, named for the English mining shire where they were first bred, are genial housemates, alert watchdogs, versatile athletes, and irresistibly cuddly TV-time companions.",
    "temperament": "Loyal, Charming, Frollicking",
    "popularity": 141,
    "min_height": 38.1,
    "max_height": 44.45,
    "min_weight": 7.71107029,
    "max_weight": 10.43262451,
    "min_expectancy": 11,
    "max_expectancy": 16,
    "group": "Terrier Group",
    "grooming_frequency_value": 0.6,
    "grooming_frequency_category": "2-3 Times a Week Brushing",
    "shedding_value": "",
    "shedding_category": "",
    "energy_level_value": 0.8,
    "energy_level_category": "Energetic",
    "trainability_value": 0.6,
    "trainability_category": "Agreeable",
    "demeanor_value": 0.6,
    "demeanor_category": "Alert/Responsive"
  },
  {
    "dog_name": "Belgian Laekenois",
    "description": "Of the four closely-related Belgian herders—the Belgian Sheepdog, Malinois, Tervuren, and Laekenois—the Laekenois is the rarest. This strong and sturdy dog is distinguished from his brethren by a rough, tousled coat that comes in shades of red or fawn or in grayish tones. The blackening around the muzzle points up the expression of keen watchfulness shining from the dark almond-shaped eyes.The Belgian Laekenois is protective of his master and property. Although observant with strangers, the breed is affectionate and friendly with those he knows well. The Laekenois coat requires regular brushing and occasional bathing, and as a working dog, it needs daily exercise. Strong, agile and full of life, the Belgian Laekenois (pronounced \"Lak-in-wah\") is one of four native dogs of Belgium. Although similar in body and temperament to the Malinois, Shepherd and Tervuren, the Laekenois differs in coat color, texture and length, as well as region of origin.",
    "temperament": "Affectionate, Alert, Intelligent",
    "popularity": "",
    "min_height": 55.88,
    "max_height": 66.04,
    "min_weight": 24.947580350000003,
    "max_weight": 29.48350405,
    "min_expectancy": 10,
    "max_expectancy": 12,
    "group": "Miscellaneous Class",
    "grooming_frequency_value": 0.4,
    "grooming_frequency_category": "Weekly Brushing",
    "shedding_value": 0.8,
    "shedding_category": "Regularly",
    "energy_level_value": 0.8,
    "energy_level_category": "Energetic",
    "trainability_value": 0.8,
    "trainability_category": "Easy Training",
    "demeanor_value": 0.4,
    "demeanor_category": "Reserved with Strangers"
  },
  {
    "dog_name": "Belgian Malinois",
    "description": "Belgian Malinois are squarely built, proud, and alert herders standing 22 to 26 inches. Strong and well-muscled, but more elegant than bulky, there’s an honest, no-frills look about them, as befit dogs built to work hard for their feed. A breed hallmark is the proud carriage of the head. Coat colors range from a rich fawn to mahogany. The black ears and mask accentuate bright, questioning eyes the color of dark Belgian chocolate.If you have ever seen a Mal perform an obedience routine, you know firsthand what a smart and eager breed this is. Problems set in, though, when this people-oriented dog is underemployed and neglected. Exercise, and plenty of it, preferably side by side with their adored owner, is key to Mal happiness. The smart, confident, and versatile Belgian Malinois is a world-class worker who forges an unbreakable bond with his human partner. To deny a Mal activity and the pleasure of your company is to deprive him of his very reasons for being.",
    "temperament": "Confident, Smart, Hardworking",
    "popularity": 43,
    "min_height": 55.88,
    "max_height": 66.04,
    "min_weight": 18.143694800000002,
    "max_weight": 36.287389600000004,
    "min_expectancy": 14,
    "max_expectancy": 16,
    "group": "Herding Group",
    "grooming_frequency_value": 0.4,
    "grooming_frequency_category": "Weekly Brushing",
    "shedding_value": 0.6,
    "shedding_category": "Seasonal",
    "energy_level_value": 0.8,
    "energy_level_category": "Energetic",
    "trainability_value": 0.8,
    "trainability_category": "Easy Training",
    "demeanor_value": 0.4,
    "demeanor_category": "Reserved with Strangers"
  },
  {
    "dog_name": "Belgian Sheepdog",
    "description": "The stirring silhouette of a Belgian Sheepdog conveys both elegance and muscular determination. A handsome feature of the breed is the exceedingly proud carriage of the head and neck. A male might stand 26 inches at the shoulder; females are smaller. The dark eyes sparkle with a questioning intelligence, and the black coat is abundant, from the neck’s “collarette” to the “breeches” of the hindquarters. In all ways, Belgian Sheepdogs are bright-eyed and bushy-tailed.In any sport or activity, a Belgian will always give 100 percent. In turn, owners tend to form a special bond with their eager workaholics. As one devotee puts it, Belgians “inspire such intense loyalty because they themselves live and love with such great passion.” The Belgian Sheepdog is a highly trainable herder whose versatility and intelligence is the stuff of canine legend. This is a breed built for hard work, and plenty of it. These sensitive souls crave human companionship and abhor neglect.",
    "temperament": "Bright, Watchful, Serious-Minded",
    "popularity": 125,
    "min_height": 55.88,
    "max_height": 66.04,
    "min_weight": 20.41165665,
    "max_weight": 34.01942775,
    "min_expectancy": 12,
    "max_expectancy": 14,
    "group": "Herding Group",
    "grooming_frequency_value": 0.6,
    "grooming_frequency_category": "2-3 Times a Week Brushing",
    "shedding_value": 0.6,
    "shedding_category": "Seasonal",
    "energy_level_value": 0.8,
    "energy_level_category": "Energetic",
    "trainability_value": 0.8,
    "trainability_category": "Easy Training",
    "demeanor_value": 0.4,
    "demeanor_category": "Reserved with Strangers"
  }
]